IDEA Open Model
LoadGroupSIA Class
Compatible with IDEA StatiCa Beta 20.0
 Load group for SIA
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.LoadGroup
 IdeaRS.OpenModel.Loading.LoadGroupSIA
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class LoadGroupSIA : LoadGroup
Public Class LoadGroupSIA
	Inherits LoadGroup
The LoadGroupSIA type exposes the following members.
Constructors
Name | Description
LoadGroupSIA
 Constructor
Top
Properties
Name | Description
Dzeta
 ζ
 (Inherited from LoadGroup.)
GammaGInf
 γ G,Inf
 (Inherited from LoadGroup.)
GammaGSup
 γ G,Sup
 (Inherited from LoadGroup.)
GammaQ
 γ Q
 (Inherited from LoadGroup.)
GroupType
 Group type
 (Inherited from LoadGroup.)
Id
 Element Id
 (Inherited from OpenElementId.)
Name
 Name of load group
 (Inherited from LoadGroup.)
Psi0
 ψ 0
Psi1
 ψ 1
Psi2
 ψ 2
Relation
 Relation
 (Inherited from LoadGroup.)
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace